import 'package:quiz_app/data/question.dart';

///
/// TAMAM IN SOALAT DASTI NEVESHTE SHODE!
///

List<Question> getQList() {
/*--------------------------------*/
  var q01 = Question();
  q01.title = '1- تعداد حلقه های المپیک؟';
  q01.image = '1';
  q01.correctAnswer = 0;
  q01.answers = ['5 عدد', '6 عدد', '7 عدد', '4 عدد'];

/*--------------------------------*/
  var q02 = Question();
  q02.title = '2- تعداد اعضای شورای نگهبان؟';
  q02.image = '2';
  q02.correctAnswer = 3;
  q02.answers = ['شش نفر', 'هشت نفر', 'سیزده نفر', 'دوازده نفر'];

/*--------------------------------*/
  var q03 = Question();
  q03.title = '3- ارتفاعات سهند در کدام استان قرار دارد؟';
  q03.image = '3';
  q03.correctAnswer = 0;
  q03.answers = ['آذربایجان شرقی', 'آذربایجان غربی', 'کردستان', 'زنجان'];

/*--------------------------------*/
  var q04 = Question();
  q04.title = '4- خرمشهر در کدام عملیات آزاد شد؟';
  q04.image = '4';
  q04.correctAnswer = 3;
  q04.answers = ['ثامن الاعمع', 'فتح المبین', 'خیبر', 'بیت المقدس'];

/*--------------------------------*/
  var q05 = Question();
  q05.title =
      '5- کدام ورزشکار ایرانی موفق به کسب مدال طلای المپیک 1966 آتلانتا شد؟';
  q05.image = '5';
  q05.correctAnswer = 1;
  q05.answers = ['امیررضا خادم', 'رسول خادم', 'حسین رضا زاده', 'عباس جدیدی'];

/*--------------------------------*/
  var q06 = Question();
  q06.title =
      '6- کدام کارگردان رکورد دار دریافت سیمرغ بهترین فیلم و کارگردانی در جشنواره فیلم فجر است؟';
  q06.image = '6';
  q06.correctAnswer = 2;
  q06.answers = [
    'مجید مجیدی',
    'اصغر فرهادی',
    'ابراهیم حاتمی کیا',
    'داریوش مهرجویی'
  ];

/*--------------------------------*/
  var q07 = Question();
  q07.title = '7- تابلوی لبخند ژکوند اثر کیست؟';
  q07.image = '7';
  q07.correctAnswer = 1;
  q07.answers = ['ونگوک', 'داوینچی', 'پیکاسو', 'رافائل'];

/*--------------------------------*/
  var q08 = Question();
  q08.title = '8- کدام درخت نماد صلح است؟';
  q08.image = '8';
  q08.correctAnswer = 3;
  q08.answers = ['سرو', 'سیب', 'نارنج', 'زیتون'];

/*--------------------------------*/
  var q09 = Question();
  q09.title = '9- گیوتین اختراع کدام کشور است؟';
  q09.image = '9';
  q09.correctAnswer = 1;
  q09.answers = ['هندوستان', 'فرانسه', 'کره شمالی', 'ترکیه'];

/*--------------------------------*/
  var q10 = Question();
  q10.title = '10- جنگ صد ساله چند سال طول کشید؟';
  q10.image = '10';
  q10.correctAnswer = 2;
  q10.answers = ['97سال', '100سال', '116سال', '121سال'];

/*--------------------------------*/
  var q11 = Question();
  q11.title = '11- تجزیه ظروف پلاستیکی چند سال طول میکشد؟';
  q11.image = '11';
  q11.correctAnswer = 1;
  q11.answers = ['50 سال', '500 سال', '5 هزار سال', '50 هزار سال'];

/*--------------------------------*/
  var q12 = Question();
  q12.title = '12- آقای گل ملی جهان کیست؟';
  q12.image = '12';
  q12.correctAnswer = 3;
  q12.answers = ['کریس رونالدو', 'مارادونا', 'لیونل مسی', 'علی دایی'];

/*--------------------------------*/
  var q13 = Question();
  q13.title = '13- جزایر لانگرهانس در کجا قرار دارد؟';
  q13.image = '13';
  q13.correctAnswer = 1;
  q13.answers = ['اقیانوسیه', 'لوز المعده', 'اسپانیا', 'جمجمه'];

/*--------------------------------*/
  var q14 = Question();
  q14.title = '14- واحد اندازه گیری الماس چیست؟';
  q14.image = '14';
  q14.correctAnswer = 3;
  q14.answers = ['گرم', 'پوند', 'سوت', 'قیراط'];

/*--------------------------------*/
  var q15 = Question();
  q15.title = '15- چند درصد بدن انسان را آب تشکیل میدهد؟';
  q15.image = '15';
  q15.correctAnswer = 3;
  q15.answers = ['30%', '40%', '50%', '60%'];

/*--------------------------------*/
  var q16 = Question();
  q16.title = '16- پاریس کوچولو لقب کدام شهر ایران است؟';
  q16.image = '16';
  q16.correctAnswer = 1;
  q16.answers = ['اصفهان', 'بروجرد', 'شیراز', 'تبریز'];

/*--------------------------------*/
  var q17 = Question();
  q17.title = '17- تعداد اعضای مجلس شورای اسلامی؟';
  q17.image = '17';
  q17.correctAnswer = 0;
  q17.answers = ['290', '350', '310', '320'];

/*--------------------------------*/
  var q18 = Question();
  q18.title = '18- باهوش ترین حیوان جهان کدام است؟';
  q18.image = '18';
  q18.correctAnswer = 3;
  q18.answers = ['سگ', 'فیل', 'دلفین', 'شامپانزه'];

/*--------------------------------*/
  var q19 = Question();
  q19.title = '19- شهر بهار نارنج لفب کدام شهر ایران است؟';
  q19.image = '19';
  q19.correctAnswer = 2;
  q19.answers = ['بوشهر', 'بوشهر', 'بابل', 'خوی'];

/*--------------------------------*/
  var q20 = Question();
  q20.title = '20- سازمان جاسوسی شوروی سابق چه نام دارد؟';
  q20.image = '20';
  q20.correctAnswer = 1;
  q20.answers = ['موساد', 'کا.گ.ب', 'سیا', 'ام.آی.6'];

/*--------------------------------*/
  return [
    q01,
    q02,
    q03,
    q04,
    q05,
    q06,
    q07,
    q08,
    q09,
    q10,
    q11,
    q12,
    q13,
    q14,
    q15,
    q16,
    q17,
    q18,
    q19,
    q20
  ];
}
